{
    "What is the gender of Harry Potter?": "Male",
    "What is the gender of Lily J. Potter?": "Female",
    "What is the gender of James Potter I?": "Male",
    "What is the gender of Ron Weasley?": "Male",
    "What is the gender of Hermione Granger?": "Female",
    "What is the gender of Cho Chang?": "Female",
    "What is the gender of Albus Potter?": "Male",
    "What is the gender of Petunia Dursley?": "Female",
    "What is the gender of Dudley Dursley?": "Male",
    "What is the gender of William Weasley?": "Male",
    "What is the gender of Charles Weasley?": "Male",
    "What is the gender of Arthur Weasley?": "Male",
    "What is the gender of Cedric Diggory ?": "Male",
    "What is the gender of Roger Davies ?": "Female",
    "What is the gender of Aberforth Dumbledore?": "Male",
    "What is the gender of Ariana Dumbledore?": "Female",
    "What is the gender of Percival Dumbledore?": "Male",
    "What is the gender of Kendra Dumbledore?": "Female",
    "What is the gender of Draco Malfoy?": "Male",
    "What is the gender of Lucius Malfoy?": "Male",
    "What is the gender of Narcissa Malfoy?": "Female",
    "What is the gender of Scorpius Malfoy?": "Male",
    "What is the gender of Astoria Malfoy?": "Female",
    "What is the hair color of Harry Potter?": "Black",
    "What is the hair color of Lily J. Potter?": "Red",
    "What is the hair color of James Potter I?": "Black",
    "What is the hair color of Ron Weasley?": "Red",
    "What is the hair color of Hermione Granger?": "Brown",
    "What is the hair color of Cho Chang?": "Black",
    "What is the hair color of Albus Potter?": "Black",
    "What is the hair color of Petunia Dursley?": "Blonde",
    "What is the hair color of Dudley Dursley?": "Blonde",
    "What is the hair color of William Weasley?": "Red",
    "What is the hair color of Charles Weasley?": "Red",
    "What is the hair color of Arthur Weasley?": "Red",
    "What is the hair color of Cedric Diggory ?": "Dark",
    "What is the hair color of Roger Davies ?": "Brown",
    "What is the hair color of Aberforth Dumbledore?": "Silver",
    "What is the hair color of Ariana Dumbledore?": "Blonde",
    "What is the hair color of Kendra Dumbledore?": "Black",
    "What is the hair color of Draco Malfoy?": "Blonde",
    "What is the hair color of Lucius Malfoy?": "Blonde",
    "What is the hair color of Narcissa Malfoy?": "Blonde",
    "What is the hair color of Scorpius Malfoy?": "Blonde",
    "Which house is Harry Potter belong to?": "Gryffindor",
    "Which house is James Potter I belong to?": "Gryffindor",
    "Which house is Ron Weasley belong to?": "Gryffindor",
    "Which house is Hermione Granger belong to?": "Gryffindor",
    "Which house is Cho Chang belong to?": "Ravenclaw",
    "Which house is Albus Potter belong to?": "Slytherin",
    "Which house is Charles Weasley belong to?": "Gryffindor",
    "Which house is Arthur Weasley belong to?": "Gryffindor",
    "Which house is Cedric Diggory  belong to?": "Hufflepuff",
    "Which house is Roger Davies  belong to?": "Ravenclaw",
    "Which house is Aberforth Dumbledore belong to?": "Gryffindor",
    "Which house is Draco Malfoy belong to?": "Slytherin",
    "Which house is Lucius Malfoy belong to?": "Slytherin",
    "Which house is Narcissa Malfoy belong to?": "Slytherin",
    "Which house is Scorpius Malfoy belong to?": "Slytherin",
    "What is the relationship of James Potter I to Harry Potter?": "Father",
    "Who is the father of Harry Potter?": "James Potter I",
    "What is the relationship of Lily J. Potter to Harry Potter?": "Mother",
    "Who is the mother of Harry Potter?": "Lily J. Potter",
    "What is the relationship of Ron Weasley to Harry Potter?": "Friend",
    "Who is the friend of Harry Potter?": "Hermione Granger",
    "What is the relationship of Hermione Granger to Harry Potter?": "Friend",
    "What is the relationship of James Potter to Lily J. Potter?": "Husband",
    "What is the relationship of Harry Potter to Lily J. Potter?": "Son",
    "Who is the son of Lily J. Potter?": "Harry Potter",
    "What is the relationship of Albus Potter to Lily J. Potter?": "Grandson",
    "Who is the grandson of Lily J. Potter?": "Albus Potter",
    "What is the relationship of Petunia Dursley to Lily J. Potter?": "Sister",
    "Who is the sister of Lily J. Potter?": "Petunia Dursley",
    "What is the relationship of Dudley Dursley to Lily J. Potter?": "Nephew",
    "Who is the nephew of Lily J. Potter?": "Dudley Dursley",
    "What is the relationship of Harry Potter to James Potter I?": "Son",
    "Who is the son of James Potter I?": "Harry Potter",
    "What is the relationship of Lily J. Potter to James Potter I?": "Wife",
    "Who is the wife of James Potter I?": "Lily J. Potter",
    "What is the relationship of Fleamont Potter to James Potter I?": "Father",
    "Who is the father of James Potter I?": "Fleamont Potter",
    "What is the relationship of Euphemia Potter to James Potter I?": "Mother",
    "Who is the mother of James Potter I?": "Euphemia Potter",
    "What is the relationship of Albus Potter to James Potter I?": "Grandson",
    "Who is the grandson of James Potter I?": "Albus Potter",
    "What is the relationship of William Weasley to Ron Weasley?": "Brother",
    "Who is the brother of Ron Weasley?": "Charles Weasley",
    "What is the relationship of Charles Weasley to Ron Weasley?": "Brother",
    "What is the relationship of Hermione Granger to Ron Weasley?": "Wife",
    "Who is the wife of Ron Weasley?": "Hermione Granger",
    "What is the relationship of Arthur Weasley to Ron Weasley?": "Father",
    "Who is the father of Ron Weasley?": "Arthur Weasley",
    "What is the relationship of Rose Granger-Weasley to Ron Weasley?": "Daughter",
    "What is the relationship of Hugo Granger-Weasley to Ron Weasley?": "Son",
    "What is the relationship of Ron Weasley to Hermione Granger?": "Husband",
    "Who is the husband of Hermione Granger?": "Ron Weasley",
    "What is the relationship of Monica Wilkins to Hermione Granger?": "Mother",
    "What is the relationship of Hugo Granger-Weasley to Hermione Granger?": "Son",
    "What is the relationship of Rose Granger-Weasley to Hermione Granger?": "Daughter",
    "What is the relationship of Percival Dumbledore to Albus Dumbledore?": "Father",
    "Who is the father of Albus Dumbledore?": "Percival Dumbledore",
    "What is the relationship of Kendra Dumbledore to Albus Dumbledore?": "Mother",
    "Who is the mother of Albus Dumbledore?": "Kendra Dumbledore",
    "What is the relationship of Aberforth Dumbledore to Albus Dumbledore?": "Brother",
    "Who is the brother of Albus Dumbledore?": "Aberforth Dumbledore",
    "What is the relationship of Ariana Dumbledore to Albus Dumbledore?": "Sister",
    "Who is the sister of Albus Dumbledore?": "Ariana Dumbledore",
    "What is the relationship of Lucius Malfoy to Draco Malfoy?": "Son",
    "Who is the son of Draco Malfoy?": "Scorpius Malfoy",
    "What is the relationship of Narcissa Malfoy to Draco Malfoy?": "Son",
    "What is the relationship of Astoria Malfoy to Draco Malfoy?": "Wife",
    "Who is the wife of Draco Malfoy?": "Astoria Malfoy",
    "What is the relationship of Scorpius Malfoy to Draco Malfoy?": "Son",
    "What is the relationship of James Potter I to Fleamont Potter?": "Son",
    "Who is the son of Fleamont Potter?": "James Potter I",
    "What is the relationship of James Potter I to Euphemia Potter?": "Son",
    "Who is the son of Euphemia Potter?": "James Potter I",
    "What is the relationship of James Potter I to Albus Potter?": "Grandfather",
    "Who is the grandfather of Albus Potter?": "James Potter I",
    "What is the relationship of Lily J. Potter to Albus Potter?": "Grandmother",
    "Who is the grandmother of Albus Potter?": "Lily J. Potter",
    "What is the relationship of Lily J. Potter to Petunia Dursley?": "Sister",
    "Who is the sister of Petunia Dursley?": "Lily J. Potter",
    "What is the relationship of Lily J. Potter to Dudley Dursley?": "Aunt",
    "Who is the aunt of Dudley Dursley?": "Lily J. Potter",
    "What is the relationship of Ron Weasley to William Weasley?": "Brother",
    "Who is the brother of William Weasley?": "Ron Weasley",
    "What is the relationship of Ron Weasley to Charles Weasley?": "Brother",
    "Who is the brother of Charles Weasley?": "Ron Weasley",
    "What is the relationship of Ron Weasley to Rose Granger-Weasley?": "Father",
    "Who is the father of Rose Granger-Weasley?": "Ron Weasley",
    "What is the relationship of Ron Weasley to Hugo Granger-Weasley?": "Father",
    "Who is the father of Hugo Granger-Weasley?": "Ron Weasley",
    "What is the relationship of Ron Weasley to Arthur Weasley?": "Son",
    "Who is the son of Arthur Weasley?": "Ron Weasley",
    "What is the relationship of Hermione Granger to Rose Granger-Weasley?": "Mother",
    "Who is the mother of Rose Granger-Weasley?": "Hermione Granger",
    "What is the relationship of Hermione Granger to Hugo Granger-Weasley?": "Mother",
    "Who is the mother of Hugo Granger-Weasley?": "Hermione Granger",
    "What is the relationship of Hermione Granger to Monica Wilkins?": "Daughter",
    "Who is the daughter of Monica Wilkins?": "Hermione Granger",
    "What is the relationship of Albus Dumbledore to Aberforth Dumbledore?": "Brother",
    "What is the relationship of Albus Dumbledore to Ariana Dumbledore?": "Brother",
    "What is the relationship of Albus Dumbledore to Percival Dumbledore?": "Son",
    "What is the relationship of Albus Dumbledore to Kendra Dumbledore?": "Son",
    "What is the relationship of Draco Malfoy to Lucius Malfoy?": "Father",
    "Who is the father of Lucius Malfoy?": "Draco Malfoy",
    "What is the relationship of Draco Malfoy to Narcissa Malfoy?": "Mother",
    "Who is the mother of Narcissa Malfoy?": "Draco Malfoy",
    "What is the relationship of Draco Malfoy to Scorpius Malfoy?": "Husband",
    "Who is the husband of Scorpius Malfoy?": "Draco Malfoy",
    "What is the relationship of Draco Malfoy to Astoria Malfoy?": "Father",
    "Who is the father of Astoria Malfoy?": "Draco Malfoy",
    "What is the type of the spell named Aberto?": "Charm",
    "What is the type of the spell named Accio?": "Charm",
    "What is the type of the spell named Age Line?": "Charm",
    "What is the type of the spell named Alarte Ascendare?": "Charm",
    "What is the type of the spell named Alohomora?": "Charm",
    "What is the type of the spell named Anti-Cheating Spell?": "Charm",
    "What is the type of the spell named Anti-Apparition Charm?": "Charm",
    "What is the type of the spell named Anti-Disapparition Jinx?": "Jinx",
    "What is the type of the spell named Anti-intruder jinx?": "Jinx",
    "What is the type of the spell named Aparecium?": "Charm",
    "What is the type of the spell named Appare Vestigium?": "Charm",
    "What is the type of the spell named Apparition?": "Transportation",
    "What is the type of the spell named Aqua Eructo?": "Charm",
    "What is the type of the spell named Arania Exumai?": "Charm",
    "What is the type of the spell named Arresto Momentum?": "Charm",
    "What is the type of the spell named Arrow-shooting spell?": "Conjuration",
    "What is the type of the spell named Ascendio?": "Charm",
    "What is the type of the spell named Avada Kedavra?": "Curse",
    "What is the type of the spell named Avifors?": "Transfiguration",
    "What is the type of the spell named Avenseguim?": "Charm",
    "What is the type of the spell named Babbling Curse?": "Curse",
    "What is the type of the spell named Badgering?": "Transfiguration",
    "What is the type of the spell named Bat-Bogey Hex?": "Hex",
    "What is the type of the spell named Bedazzling Hex?": "Hex",
    "What is the type of the spell named Bewitched Snowballs?": "Charm",
    "What is the type of the spell named Bluebell Flames?": "Charm",
    "What is the type of the spell named Blue sparks?": "Charm",
    "What is the type of the spell named Bombarda?": "Charm",
    "What is the type of the spell named Bombarda Maxima?": "Charm",
    "What is the type of the spell named Bravery Charm?": "Charm",
    "What is the type of the spell named Bridge-conjuring spell?": "Charm",
    "What is the type of the spell named Broom jinx?": "Jinx",
    "What is the type of the spell named Bubble-Head Charm?": "Charm",
    "What is the type of the spell named Bubble Spell?": "Charm",
    "What is the type of the spell named Calvorio?": "Curse",
    "What is the type of the spell named Cantis?": "Charm",
    "What is the type of the spell named Capacious extremis?": "Charm",
    "What is the type of the spell named Carpe Retractum?": "Charm",
    "What is the type of the spell named Cascading Jinx?": "Jinx",
    "What is the type of the spell named Caterwauling Charm?": "Charm",
    "What is the type of the spell named Cave inimicum?": "Charm",
    "What is the type of the spell named Celescere?": "Charm",
    "What is the type of the spell named Cheering Charm?": "Charm",
    "What is the type of the spell named Circumrota?": "Charm",
    "What is the type of the spell named Cistem Aperio?": "Charm",
    "What is the type of the spell named Colloportus?": "Charm",
    "What is the type of the spell named Colloshoo?": "Hex",
    "What is the type of the spell named Colovaria?": "Charm",
    "What is the type of the spell named Confringo?": "Curse",
    "What is the type of the spell named Confundo?": "Charm",
    "What is the type of the spell named Conjunctivitis Curse?": "Curse",
    "What is the type of the spell named Cracker Jinx?": "Jinx",
    "What is the type of the spell named Cribbing Spell?": "Spell",
    "What is the type of the spell named Crinus Muto?": "Transfiguration",
    "What is the type of the spell named Crucio?": "Curse",
    "What is the type of the spell named Defodio?": "Charm",
    "What is the type of the spell named Deletrius?": "Charm",
    "What is the type of the spell named Densaugeo?": "Hex",
    "What is the type of the spell named Deprimo?": "Charm",
    "What is the type of the spell named Depulso?": "Charm",
    "What is the type of the spell named Descendo?": "Charm",
    "What is the type of the spell named Deterioration Hex?": "Hex",
    "What is the type of the spell named Diffindo?": "Charm",
    "What is the type of the spell named Diminuendo?": "Charm",
    "What is the type of the spell named Dissendium?": "Charm",
    "What is the type of the spell named Disillusionment Charm?": "Charm",
    "What is the type of the spell named Draconifors?": "Transfiguration",
    "What is the type of the spell named Drought Charm?": "Charm",
    "What is the type of the spell named Duro?": "Charm",
    "What is the type of the spell named Ear-shrivelling Curse?": "Curse",
    "What is the type of the spell named Ebublio?": "Jinx",
    "What is the type of the spell named Engorgio?": "Charm",
    "What is the type of the spell named Entrail-Expelling Curse?": "Curse",
    "What is the type of the spell named Epoximise?": "Transfiguration",
    "What is the type of the spell named Erecto?": "Charm",
    "What is the type of the spell named Evanesce?": "Transfiguration",
    "What is the type of the spell named Evanesco?": "Transfiguration",
    "What is the type of the spell named Everte Statum?": "Spell",
    "What is the type of the spell named Expecto Patronum?": "Charm",
    "What is the type of the spell named Expelliarmus?": "Charm",
    "What is the type of the spell named Expulso?": "Curse",
    "What is the type of the spell named Extinguishing Spell?": "Charm",
    "What is the type of the spell named Feather-light charm?": "Charm",
    "What is the type of the spell named Fianto Duri?": "Charm",
    "What is the type of the spell named Fidelius Charm?": "Charm",
    "What is the type of the spell named Fiendfyre?": "Curse",
    "What is the type of the spell named Finestra?": "Charm",
    "What is the type of the spell named Finite Incantatem?": "Counter-Spell",
    "What is the type of the spell named Finger-removing jinx?": "Jinx",
    "What is the type of the spell named Firestorm?": "Charm",
    "What is the type of the spell named Flagrante Curse?": "Curse",
    "What is the type of the spell named Flagrate?": "Charm",
    "What is the type of the spell named Flame-Freezing Charm?": "Charm",
    "What is the type of the spell named Flask-conjuring spell?": "Conjuration",
    "What is the type of the spell named Flintifors?": "Transfiguration",
    "What is the type of the spell named Flipendo?": "Jinx",
    "What is the type of the spell named Flipendo Duo?": "Jinx",
    "What is the type of the spell named Flipendo Maxima?": "Jinx",
    "What is the type of the spell named Flipendo Tria?": "Jinx",
    "What is the type of the spell named Flying charm?": "Charm",
    "What is the type of the spell named Fracto Strata?": "Spell",
    "What is the type of the spell named Fumos?": "Charm",
    "What is the type of the spell named Fumos Duo?": "Charm",
    "What is the type of the spell named Furnunculus?": "Jinx",
    "What is the type of the spell named Fur spell?": "Charm",
    "What is the type of the spell named Geminio?": "Charm",
    "What is the type of the spell named Glacius?": "Charm",
    "What is the type of the spell named Glacius Duo?": "Charm",
    "What is the type of the spell named Glacius Tria?": "Charm",
    "What is the type of the spell named Glisseo?": "Charm",
    "What is the type of the spell named Gripping Charm?": "Charm",
    "What is the type of the spell named Hair-thickening Charm?": "Charm",
    "What is the type of the spell named Herbifors?": "Transfiguration",
    "What is the type of the spell named Herbivicus?": "Charm",
    "What is the type of the spell named Homenum Revelio?": "Charm",
    "What is the type of the spell named Homonculous Charm?": "Charm",
    "What is the type of the spell named Hurling Hex?": "Hex",
    "What is the type of the spell named Impedimenta?": "Jinx",
    "What is the type of the spell named Imperio?": "Curse",
    "What is the type of the spell named Inanimatus Conjurus?": "Transfiguration",
    "What is the type of the spell named Incarcerous?": "Conjuration",
    "What is the type of the spell named Inflatus?": "Jinx",
    "What is the type of the spell named Jelly-Brain Jinx?": "Jinx",
    "What is the type of the spell named Jelly-Fingers Curse?": "Curse",
    "What is the type of the spell named Knee-reversal hex?": "Hex",
    "What is the type of the spell named Langlock?": "Jinx",
    "What is the type of the spell named Lapifors?": "Transfiguration",
    "What is the type of the spell named Leek Jinx?": "Jinx",
    "What is the type of the spell named Levicorpus?": "Jinx",
    "What is the type of the spell named Liberacorpus?": "Counter-Jinx",
    "What is the type of the spell named Locomotor Mortis?": "Curse",
    "What is the type of the spell named Melofors?": "Jinx",
    "What is the type of the spell named Meteolojinx recanto?": "Counter-Charm",
    "What is the type of the spell named Mimblewimble?": "Curse",
    "What is the type of the spell named Multicorfors?": "Transfiguration",
    "What is the type of the spell named Obscuro?": "Conjuration",
    "What is the type of the spell named Oppugno?": "Jinx",
    "What is the type of the spell named Orbis?": "Jinx",
    "What is the type of the spell named Orchideous?": "Conjuration",
    "What is the type of the spell named Pepper Breath?": "Hex",
    "What is the type of the spell named Petrificus Totalus?": "Curse",
    "What is the type of the spell named Piscifors?": "Transfiguration",
    "What is the type of the spell named Point Me?": "Spell",
    "What invisible creatures pull the floats at Hogwarts?": "Thestrals",
    "Which people can see the Thestrals creatures?": "Those who have witnessed death",
    "What creature is Aragog in the magical world of Harry Potter?": "Acromantula",
    "What type of bird is Harry's loyal feathered friend Hedwig?": "Snowy Owl",
    "What animal's tears are the only known antidote to basilisk poison?": "Phoenix",
    "What magical plant appears to have floating fruit?": "Dirigible plum",
    "What magical creatures guard Azkaban?": "Dementors",
    "What magical creatures deliver mail in the wizarding world?": "Owls",
    "What magical creatures infest the Forbidden Forest and terrify Ron?": "Spiders",
    "What magical creatures pull the carriages at Hogwarts?": "Thestrals",
    "What is the name of Hagrid's faithful companion and dog?": "Fang",
    "What is the name of the giant spider in the Forbidden Forest?": "Aragog",
    "What is the name of the driver of the Knight Bus?": "Ernie",
    "What is the name of the first Goblin that greets Harry Potter at Gringotts bank?": "Griphook",
    "What is the name of the house-elf who served Barty Crouch Senior?": "Winky",
    "Who spoke at Aragog's funeral?": "Harry Potter",
    "What ghost does Peeves fear?": "The Bloody Baron",
    "Who is the caretaker at Hogwarts?": "Argus Filch",
    "What is the name of Filch's cat?": "Mrs Norris",
    "What is the name of the ghost of Gryffindor house?": "Nearly Headless Nick",
    "What is the name of the ghost of Slytherin house?": "The Bloody Baron",
    "What is the name of the ghost of Hufflepuff house?": "The Fat Friar",
    "What is the name of the ghost of Ravenclaw house?": "The Grey Lady",
    "What is the name of the centaur who helps Harry in the Forbidden Forest?": "Firenze",
    "Where was Harry born?": "Godric's Hollow",
    "From which London station does the Hogwarts Express depart?": "King's Cross Station",
    "What is the name of the magical train platform at King's Cross?": "Platform Nine and Three-Quarters",
    "What is the name of the wizarding bank?": "Gringotts",
    "What is the name of the magical map Harry uses?": "The Marauder's Map",
    "What is the name of the magical street where wizards shop?": "Diagon Alley",
    "What is the name of the magical pub in Diagon Alley?": "The Leaky Cauldron",
    "What is the name of the magical sweet shop in Hogsmeade?": "Honeydukes",
    "What is the name of the magical joke shop in Diagon Alley?": "Weasleys' Wizard Wheezes",
    "What is the name of the magical bus for stranded witches and wizards?": "The Knight Bus",
    "Where is the Slytherin Common Room?": "In the dungeons, under the Black Lake",
    "What is the shape of the knocker on the door to the Ravenclaw Common Room?": "An eagle",
    "What is the name of the magical device used by Dumbledore and Harry to see memories?": "Pensieve",
    "Where was the headquarters of the Order of the Phoenix located?": "12 Grimmauld Place",
    "What is the name of the village near Hogwarts?": "Hogsmeade",
    "What is the name of the magical bookshop in Diagon Alley?": "Flourish and Blotts",
    "What is the name of the magical object that can bring people back from the dead?": "Resurrection Stone",
    "What magical artefact creates the Elixir of Life?": "The Philosopher's Stone",
    "Who is known as the 'Chosen One'?": "Harry Potter",
    "What is Voldemort’s mother’s name?": "Merope Gaunt",
    "What is Harry’s middle name?": "James",
    "Who wrote 'A History of Magic'?": "Bathilda Bagshot",
    "Who killed Dobby the elf with a knife in the first part of Harry Potter and the Deathly Hallows?": "Bellatrix Lestrange",
    "Who killed Sirius Black?": "Bellatrix Lestrange",
    "Who killed Remus Lupin?": "Antonin Dolohov",
    "Who killed Nymphadora Tonks?": "Bellatrix Lestrange",
    "Who killed Fred Weasley?": "Augustus Rookwood",
    "Who killed Bellatrix Lestrange?": "Molly Weasley",
    "Who killed Lord Voldemort?": "Harry Potter",
    "Who did Professor Lupin marry?": "Nymphadora Tonks",
    "Who becomes Minister for Magic after Voldemort's defeat?": "Kingsley Shacklebolt",
    "Who was expelled from Hufflepuff House?": "Newt Scamander",
    "Who was the Rook in the Chessboard Chamber?": "Hermione Granger",
    "Who is the master of the Elder Wand after Dumbledore?": "Draco Malfoy",
    "Who is the master of the Elder Wand after Draco Malfoy?": "Harry Potter",
    "Who is the Half-Blood Prince?": "Severus Snape",
    "What job does Luna Lovegood's father hold?": "Editor of The Quibbler",
    "Who did Fred and George Weasley use to spy on Order of the Phoenix meetings?": "Extendable Ears",
    "Who gave Harry the Gillyweed to use for the second task in the ‘Harry Potter & the Goblet of Fire’ movie?": "Neville Longbottom",
    "Who is the head of the Department of Magical Law Enforcement?": "Amelia Bones",
    "Who lied to Voldemort during the final battle by proclaiming that Harry Potter was dead?": "Narcissa Malfoy",
    "Who among the following served as a Hufflepuff Prefect?": "Hannah Abbott",
    "Who can master a wand with a Thestral tail hair core?": "A wizard who has accepted death",
    "Which finger was Peter Pettigrew missing?": "The index finger on his right hand",
    "The 'Felifors' spell turns a cat into a what?": "Cauldron",
    "What illegal spell did Harry use to save himself and Dudley at the beginning of ‘Harry Potter & the Order of the Phoenix’?" : "Patronus Charm",
    "What assignment did Dolores Umbridge give Harry as a punishment for 'lying' about Voldemort?": "Writing lines with a blood quill",
    "What did Dumbledore bequeath to Ron?": "Deluminator",
    "What magical plant is used to cure petrification?": "Mandrake",
    "What magical potion forces the drinker to tell the truth?": "Veritaserum",
    "What magical potion allows someone to change their appearance?": "Polyjuice Potion",
    "What magical potion grants luck?": "Felix Felicis",
    "What magical potion allows someone to breathe underwater?": "Gillyweed",
    "What spell did Hermione use to unlock the door to the third-floor corridor?": "Alohomora",
    "What spell did Harry use to defeat the Basilisk?": "Sword of Gryffindor",
    "What spell did Harry use to summon his broom during the first task of the Triwizard Tournament?": "Accio",
    "What spell did Hermione use to fix Harry's glasses?": "Oculus Reparo",
    "What spell is used to produce light at the tip of the wand?": "Lumos",
    "What spell is used to silence someone?": "Silencio",
    "What spell is used to conjure a Patronus?": "Expecto Patronum",
    "What spell is used to erase memories?": "Obliviate",
    "What spell is used to repair objects?": "Reparo",
    "What spell is used to freeze someone?": "Immobulus",
    "What spell is used to unlock a person's mind?": "Legilimens",
    "What spell is used to protect against dark magic?": "Protego",
    "What spell is used to disarm an opponent?": "Expelliarmus",
    "What spell is used to summon objects?": "Accio",
    "What spell is used to levitate objects?": "Wingardium Leviosa",
    "What spell is used to unlock doors?": "Alohomora",
    "What is the name of the ball used to score in Quidditch?": "Quaffle",
    "What is the name of the ball that tries to knock players off their brooms?": "Bludger",
    "What is the name of the small golden ball in Quidditch?": "Golden Snitch",
    "Which creature was used in Quidditch before being replaced by the Golden Snitch?": "The Golden Snidget",
    "What position does Harry play in Quidditch?": "Seeker",
    "Who is the captain of the Gryffindor Quidditch team in Harry's first year?": "Oliver Wood",
    "What did the Dursleys give Harry for Christmas in his first year at Hogwarts?": "A fifty-pence piece",
    "What is the name of the magical competition held at Hogwarts in Harry's fourth year?": "Triwizard Tournament",
    "What is the name of the magical goblet used in the Triwizard Tournament?": "The Triwizard Cup",
    "What is the name of the magical contract that binds the Triwizard champions?": "The Goblet of Fire",
    "During the Triwizard Tournament, who escorted Hermione to the Yule Ball?": "Viktor Krum",
    "What was connected by the Floo Network, creating a mode of transportation for witches and wizards?": "Fireplaces",
    "When Harry was learning the Patronus Charm, what happy memory did he initially use?": "Riding a broomstick for the first time",
    "Hermione discovered that the Basilisk was moving around the castle using what?": "The plumbing",
    "What is the name of the British Ministry of Magic's high court of law and parliament?": "The Wizengamot",
    "What is Draco Malfoy's wand made of?": "Hawthorn wood with a unicorn hair core",
    "Which Wizarding school did Gellert Grindelwald attend?": "Durmstrang Institute",
    "What is the name of the founder of Ravenclaw house?": "Rowena Ravenclaw",
    "What is the name of the founder of Hufflepuff house?": "Helga Hufflepuff",
    "What is the name of the founder of Slytherin house?": "Salazar Slytherin",
    "What is the name of the founder of Gryffindor house?": "Godric Gryffindor",
    "What tool did Harry use in his first task in the Triwizard Tournament?": "His Firebolt broomstick",
    "How does Harry find out that his father bullied Professor Snape?": "Through Snape's memories in the Pensieve",
    "Where do Voldemort and Dumbledore duel in ‘Harry Potter & the Order of the Phoenix’?" : "The Ministry of Magic",
    "What sound does Ron make after eating a magical candy in the movie?": "A lion’s roar",
    "What is Parvati Patil’s Boggart in the book?": "A mummy",
    "What is Parvati Patil’s Boggart in the movie?": "A giant cobra",
    "How does Parvati defeat her Boggart in the book?": "The mummy trips on its wrappings",
    "How does Parvati defeat her Boggart in the movie?": "It turns into a giant jack-in-the-box",
    "At what age do unicorns turn from gold or silver to pure white, according to Harry Potter?": "7",
    "Poor Nearly Headless Nick! How many times did the executioner chop off his head but not quite finish the job?": "45",
    "How many Deathly Hallows are there that will make you the Master of Death?": "3",
    "How many Horcruxes do Harry and his friends have to destroy to defeat Voldemort in the final battle?": "7",
    "What sort of establishment is the Leaky Cauldron?": "Pub",
    "What did Xenophilius Lovegood believe Billywig wings could induce?": "Levitation",
    "Dittany, mixed with what ingredient, can cure a Werewolf bite?": "Silver",
    "What is the name of the popular wizarding newspaper based in London, England?": "The Daily Prophet",
    "What kind of wood is Harry’s first wand made out of?": "Holly",
    "Where does Rubeus Hagrid first tell Harry that he’s a wizard?": "In a hut on a rock",
    "What does Harry do to impress Professor McGonagall enough that she gets him on the Gryffindor Quidditch team?": "Catches Neville Longbottom’s Remembrall",
    "Which puzzle guarding the Sorcerer’s Stone does Hermione Granger solve?": "Professor Snape’s logic puzzle with potion bottles",
    "Which mischievous character from the books did not feature in the movies?": "Peeves the Poltergeist",
    "The Hogwarts motto is “Draco dormiens nunquam titillandus.” What does it mean?": "Never tickle a sleeping dragon",
    "When was the first Harry Potter book published?": "1997",
    "When was the first Harry Potter film released?": "2001",
    "What should the user of the Marauder's Map say after using it to reset it?": "Mischief managed",
    "What street in England does the Dursley family live on?": "Number 4 Privet Drive",
    "What plant does Harry Potter eat in the Black Lake so he can breathe underwater in the Triwizard Tournament?": "Gillyweed",
    "What is the name given to the three-headed watchdog?": "Fluffy",
    "What animal form does Luna Lovegood's patronus take?": "Hare",
    "What is the name of Hagrid’s half-brother?": "Grawp",
    "What animal is Dolores Umbridge obsessed with?": "Cats",
    "In the book, what sport has Dudley recently taken up?": "Boxing",
    "How many secret passages were shown on the Marauder’s Map?": "Seven",
    "Who turned Draco Malfoy into a ferret?": "Alastor Moody",
    "Which two other schools joined Hogwarts for the Triwizard Tournament?": "Beauxbatons and Durmstrang",
    "Which book did Lucius Malfoy pull out from Ginny Weasley’s cauldron in Flourish and Blotts?": "Tom Riddle's Diary",
    "What place does Moaning Myrtle haunt in Hogwarts?": "The girls' bathroom",
    "Which spell did Gilderoy Lockhart use to heal Harry’s arm?": "Brackium Emendo",
    "Which professor fights off the Dementor attacking Harry in ‘Harry Potter & the Prisoner of Azkaban’?": "Professor Remus Lupin",
    "Which equipment did Hermione use to take different classes at the same exact time?": "Time-Turner",
    "Who was the Secret Keeper of the Potter family?": "Peter Pettigrew",
    "What is the name of the magical creature that can only be seen by those who have witnessed death?": "Thestral",
    "What is Draco Malfoy’s mother’s name?": "Narcissa",
    "What spell did Snape invent that Harry later uses on Draco Malfoy?": "Sectumsempra",
    "What does Hermione smell in the amortenia (or love) potion?": "Grass, parchment, spearmint toothpaste and Ron Weasley’s hair",
    "True or false: This is the longest movie in the franchise.": "False! Harry Potter and the Chamber of Secrets is the longest movie, at 161 minutes.",
    "Lily Potter once gave Professor Slughorn a bowl with a lily that turned into a goldfish. What was the goldfish’s name?": "Francis",
    "How many Horcruxes have been destroyed at the end of this story?": "Seven",
    "Who is the editor of The Quibbler?": "Xenophilius Lovegood",
    "What is the name of the magical object used to destroy Horcruxes?": "Sword of Gryffindor",
    "What is the name of the magical object used to store memories?": "Pensieve",
    "What is the name of the magical object that shows the location of everyone in Hogwarts?": "The Marauder's Map",
    "What is the name of the magical object that transports people instantly?": "Portkey",
    "What is the name of the magical object that can make someone invisible?": "Invisibility Cloak",
    "What are the three Deathly Hallows?": "Elder Wand, Resurrection Stone, Invisibility Cloak",
    "What are the first names of the Patil sisters?": "Parvati and Padma",
    "In which book is Luna Lovegood introduced?": "Harry Potter and the Order of the Phoenix",
    "What type of animal does Ginny kill while possessed by Voldemort?": "Roosters",
    "Which magical sweet comes with collectible cards?": "Chocolate frogs",
    "What does Dobby call Ron Weasley?": "Wheezy",
    "What is the Gryffindor motto?": "Forti Animo Estote",
    "What do wizards call non-magical people?": "Muggles",
    "Which house did the Sorting Hat consider for Hermione?": "Ravenclaw",
    "What was Moaning Myrtle’s real name?": "Myrtle Warren",
    "How did Lily and Snape first meet?": "As children near the playground",
    "What is the core of Voldemort’s wand?": "Phoenix feather",
    "Who originally published the Harry Potter books?": "Bloomsbury",
    "What is Dumbledore’s full name?": "Albus Percival Wulfric Brian Dumbledore",
    "What spell summons Hogwarts' guardians?": "Piertotum Locomotor",
    "Which actors played Bill Weasley and Mad-Eye Moody?": "Domhnall Gleeson and Brendan Gleeson",
    "What potion did Harry brew for Slughorn?": "Draught of Living Death",
    "What coins are used in the wizarding world?": "Galleons, Sickles, and Knuts",
    "Who is the eldest: Harry, Ron, or Hermione?": "Hermione",
    "Who refereed the 1994 Quidditch World Cup?": "Hassan Mostafa",
    "What is the title of Chapter 1 in 'Sorcerer's Stone'?": "The Boy Who Lived",
    "What do powdered asphodel and wormwood make?": "Draught of Living Death",
    "Where is a bezoar stone found?": "In a goat’s stomach",
    "What color does Neville’s Remembrall turn?": "Red",
    "What was the first Gryffindor common room password?": "Caput Draconis",
    "Who was the Slytherin Quidditch team captain?": "Marcus Flint",
    "What do Hermione’s parents do?": "Dentists",
    "What Christmas sweaters did Mrs. Weasley make?": "Maroon with golden letters",
    "What did Harry pull from wizard crackers?": "A wizard chess set",
    "What did Dumbledore see in the Mirror of Erised?": "Woolen socks",
    "Which dragons are native to Britain?": "Common Welsh Green and Hebridean Black",
    "What did Hagrid name his dragon?": "Norbert",
    "What planet was bright during Harry’s first Forest trip?": "Mars",
    "Which centaurs did Harry meet?": "Ronan, Bane, and Firenze",
    "What did Hermione score in Charms?": "112%",
    "What spell froze Neville?": "Petrificus Totalus",
    "Who placed protections on the Sorcerer’s Stone?": "Hagrid, Sprout, Flitwick, McGonagall, Quirrell, Snape, Dumbledore",
    "How long was Harry hospitalized after facing Voldemort?": "3 days",
    "What present did Hagrid give Harry in the hospital?": "A photo album",
    "How many points did Dumbledore award Neville?": "10",
    "What is Nicholas Flamel’s wife’s name?": "Perenelle",
    "What is the cure for Petrification?": "Mandrake Restorative Draught",
    "Who guards the Gryffindor common room?": "The Fat Lady",
    "What is the first line of 'Sorcerer’s Stone'?": "Mr. and Mrs. Dursley, of number four, Privet Drive, were proud to say that they were perfectly normal, thank you very much.",
    "Where did Harry first see Draco?": "Madame Malkin’s robe shop",
    "What did the Dursleys give Harry for Christmas?": "A 50-pence piece",
    "What library was Hogwarts’ Restricted Section?": "Bodleian Library",
    "Who explained the Chamber of Secrets in the book?": "Professor Binns",
    "Why did Neville faint in Herbology?": "Loose earmuffs exposed him to Mandrake cries",
    "When did the Weasleys rescue Harry?": "July 31 (his birthday)",
    "Who removed Harry’s arm bones?": "Gilderoy Lockhart",
    "Who stole Polyjuice ingredients?": "Hermione",
    "Who was Petrified with Hermione?": "Penelope Clearwater",
    "Where did Arthur Weasley work?": "Misuse of Muggle Artefacts Office",
    "How many Muggles saw the flying Ford Anglia?": "Seven",
    "What is Gilderoy Lockhart’s favorite color?": "Lilac",
    "Who was Hogwarts’ headmaster during Tom Riddle’s time?": "Armando Dippet",
    "What is Lockhart’s autobiography called?": "Magical Me",
    "Where did Harry first hear the Basilisk?": "Lockhart’s office",
    "Who temporarily guarded Gryffindor Tower?": "Sir Cadogan",
    "Who overheard Sirius Black’s betrayal?": "McGonagall, Flitwick, Hagrid, Fudge, and Rosmerta",
    "Why did Ron and Hermione stop speaking?": "Crookshanks attacked Scabbers",
    "What does Aunt Marge do?": "Bulldog breeder",
    "What sound did Ron make after eating candy?": "A lion’s roar",
    "What was Parvati’s Boggart in the book?": "A mummy",
    "How did Parvati defeat her Boggart?": "Made it trip on wrappings",
    "Where did Hedwig find Harry?": "Leaky Cauldron",
    "What bird was on Neville’s Boggart hat?": "Vulture",
    "Which page did Snape assign for werewolves?": "394",
    "What are Hippogriffs a mix of?": "Horse and eagle",
    "How much gold did the Weasleys win?": "700 Galleons",
    "Who grew a beard cheating into the Triwizard Tournament?": "Fred and George",
    "Which characters were omitted from the movie?": "The Dursleys",
    "Which bands played the Weird Sisters?": "Pulp and Radiohead",
    "How did Cedric distract his dragon?": "Transfigured a rock into a dog",
    "What is Mad-Eye’s catchphrase?": "CONSTANT VIGILANCE!",
    "What challenge was cut from the maze?": "The Sphinx’s riddle",
    "What candy did Dudley eat?": "Ton-Tongue Toffee",
    "What did Moody turn Draco into?": "A ferret",
    "Which Quidditch team did Ludo Bagman play for?": "Wimbourne Wasps",
    "What position did Ludo play?": "Beater",
    "What was Ron’s role in S.P.E.W.?": "Treasurer",
    "What moment was cut from 'Order of the Phoenix'?": "Gryffindor winning Quidditch Cup",
    "Why was Harry put on trial?": "Using Patronus Charm near Dudley",
    "Who named 'Dumbledore’s Army'?": "Cho Chang and Ginny",
    "Who doubted Harry’s story initially?": "Seamus Finnigan",
    "How did Dumbledore escape capture?": "Used Fawkes to teleport",
    "Where did Harry and Cho kiss?": "Room of Requirement",
    "What’s the Order’s headquarters address?": "12 Grimmauld Place",
    "What did Sirius’ mother do to his name?": "Burned it off the tapestry",
    "What did Harry find in the writing desk?": "A locket",
    "Who was Ron’s love interest in Half-Blood Prince?": "Lavender Brown",
    "Which fake Horcrux did Dumbledore find?": "Slytherin’s locket",
    "What’s Fred and George’s shop called?": "Weasleys' Wizard Wheezes",
    "What gemstone was in the cursed necklace?": "Opals",
    "What spell did Snape invent?": "Sectumsempra",
    "What did Hermione smell in Amortentia?": "Grass, parchment, toothpaste, Ron’s hair",
    "What was Lily’s goldfish named?": "Francis",
    "How many Horcruxes were destroyed by the end?": "Two",
    "What did the Weasleys’ clock show?": "Mortal peril",
    "Who was in Dumbledore’s first memory?": "Bob Ogden",
    "What are the three D’s of Apparition?": "Destination, Determination, Deliberation",
    "Who lost an ear in Deathly Hallows?": "George Weasley",
    "Who became Minister after Voldemort?": "Kingsley Shacklebolt",
    "Who hugged Draco in the movie?": "Voldemort",
    "What is the Snitch’s size compared to?": "A walnut",
    "What is the model of the Weasleys’ car?": "Ford Anglia",
    "What’s the core of Harry’s wand?": "Phoenix feather",
    "Who replaced Oliver Wood as Quidditch captain?": "Angelina Johnson",
    "When was Deathly Hallows published?": "2007",
    "How long is Harry’s wand?": "11 inches",
    "What’s key in Polyjuice Potion?": "DNA of the target",
    "Who directed the last three films?": "David Yates",
    "How long does Polyjuice take to brew?": "One month",
    "What spell did Lockhart use on Harry’s arm?": "Brackium Emendo",
    "Who played Cedric Diggory?": "Robert Pattinson",
    "What is the Half-Blood Prince’s real identity?": "Severus Snape",
    "Who played Bellatrix Lestrange?": "Helena Bonham Carter",
    "What spell killed Voldemort?": "Expelliarmus",
    "Who were the Marauders?": "James, Sirius, Remus, Peter",
    "What is Luna’s father’s name?": "Xenophilius Lovegood",
    "Why did Snape make an Unbreakable Vow?": "To protect Draco",
    "What is the driver of the Knight Bus named?": "Ernie",
    "Which founder was Rowena Ravenclaw?": "Ravenclaw founder",
    "Who killed Dobby?": "Bellatrix Lestrange",
    "What is Hagrid’s dog’s name?": "Fang",
    "What does 'Felifors' do?": "Turns a cat into a cauldron",
    "What cures basilisk venom?": "Phoenix tears",
    "Who played Draco Malfoy?": "Tom Felton",
    "What position did Harry play?": "Seeker",
    "What is the Snitch’s predecessor?": "Golden Snidget",
    "What is Ron’s Patronus?": "Jack Russell terrier",
    "What is Hermione’s Patronus?": "Otter",
    "Who is the Gryffindor ghost?": "Nearly Headless Nick",
    "What is the Slytherin ghost?": "The Bloody Baron",
    "What is Hufflepuff’s ghost?": "The Fat Friar",
    "What is Ravenclaw’s ghost?": "The Grey Lady",
    "What is the Hogwarts motto in English?": "Never tickle a sleeping dragon",
    "When was the first movie released?": "2001",
    "What is the Leaky Cauldron?": "A pub",
    "What is Dumbledore’s Patronus?": "Phoenix",
    "What is Snape’s Patronus?": "Doe",
    "What is the Ministry’s owl-based system?": "Interdepartmental memos",
    "What is Fleur’s maiden name?": "Delacour",
    "What is Fleur’s creature heritage?": "Veela",
    "What is the Triwizard Cup?": "A portkey",
    "What is the effect of Felix Felicis?": "Makes you lucky",
    "What is Grawp’s relation to Hagrid?": "Half-brother",
    "Who is the Hogwarts gamekeeper?": "Rubeus Hagrid",
    "What is the Room of Requirement?": "A magical room that appears when needed",
    "What is the effect of Veritaserum?": "Forces truth-telling",
    "Who is Moaning Myrtle?": "A ghost in the girls' bathroom",
    "What is the effect of the Imperius Curse?": "Controls actions",
    "What is the effect of the Cruciatus Curse?": "Causes intense pain",
    "What is the effect of the Killing Curse?": "Instant death",
    "Who is the Minister of Magic in book 7?": "Pius Thicknesse (under Voldemort)",
    "What is the name of Hermione’s NGO?": "S.P.E.W.",
    "What is the effect of a Portkey?": "Teleports users",
    "What is the effect of the Fidelius Charm?": "Hides secrets in a person’s soul",
    "Who is the Secret-Keeper for the Potters?": "Peter Pettigrew",
    "What is the effect of Polyjuice Potion?": "Transforms appearance",
    "What is the Unforgivable Curses’ penalty?": "Life in Azkaban",
    "Who teaches Divination?": "Sybill Trelawney",
    "Who teaches Care of Magical Creatures?": "Rubeus Hagrid",
    "Who teaches Transfiguration?": "Minerva McGonagall",
    "Who teaches Potions in book 6?": "Horace Slughorn",
    "Who is the Heir of Slytherin?": "Tom Riddle",
    "What is the effect of the Draught of Living Death?": "Induces coma-like sleep",
    "What is the effect of Wolfsbane Potion?": "Helps werewolves retain sanity",
    "What is the effect of the Memory Charm?": "Erases memories",
    "Who is the author of 'Fantastic Beasts'?": "Newt Scamander",
    "What is the effect of the Muffliato Charm?": "Creates buzzing noise to prevent eavesdropping",
    "What is the effect of the Protean Charm?": "Links objects to a master copy",
    "What is the effect of the Gemino Curse?": "Creates multiplying copies",
    "What is the effect of the Langlock Jinx?": "Glues tongue to roof of mouth",
    "What is the effect of the Leg-Locker Curse?": "Locks legs together",
    "What is the effect of the Reductor Curse?": "Blasts objects apart",
    "What is the effect of the Shield Charm?": "Deflects spells",
    "What is the effect of the Silencing Charm?": "Mutes the target",
    "What is the effect of the Slowing Charm?": "Slows falling objects",
    "What is the effect of the Stunning Spell?": "Renders unconscious",
    "What is the effect of the Tickling Charm?": "Induces laughter",
    "What is the effect of the Tongue-Tying Curse?": "Prevents speech about specific topics",
    "What is the effect of the Vanishing Spell?": "Makes objects disappear",
    "What is the effect of the Water-Making Spell?": "Conjures water",
    "Who is the head of the Wizengamot?": "Chief Warlock (Dumbledore)",
    "What is the effect of the Entrancing Enchantment?": "Charms objects to attract",
    "What is the effect of the Flame-Freezing Charm?": "Makes flames harmless",
    "What is the effect of the Hover Charm?": "Levitates objects",
    "What is the effect of the Impervius Charm?": "Repels substances",
    "What is the effect of the Mending Charm?": "Repairs broken objects",
    "What is the effect of the Obliteration Charm?": "Removes footprints",
    "What is the effect of the Packing Charm?": "Packs luggage automatically",
    "What is the effect of the Scouring Charm?": "Cleans objects",
    "What is the effect of the Severing Charm?": "Cuts objects",
    "What is the effect of the Smokescreen Spell?": "Creates obscuring smoke",
    "What is the effect of the Softening Charm?": "Softens surfaces",
    "What is the effect of the Supersensory Charm?": "Heightens senses",
    "What is the effect of the Unbreakable Vow?": "Magically binding promise",
    "What is the effect of the Wand-Extinguishing Charm?": "Dampens magical effects",
    "What is the effect of the Wand-Lighting Charm?": "Illuminates wand tip",
    "What is the effect of the Weather-Modifying Charm?": "Changes local weather",
    "What is the effect of the Whistle Spell?": "Produces a whistle sound",
    "What is the effect of the Wound-Cleansing Spell?": "Disinfects injuries",
    "What is the effect of the Arrow-Shooting Spell?": "Fires magical arrows",
    "What is the effect of the Dancing Feet Spell?": "Forces target to dance",
    "What is the effect of the Disarming Charm?": "Knocks away opponent’s wand",
    "What is the effect of the Exploding Charm?": "Causes explosions",
    "What is the effect of the Fire-Making Spell?": "Conjures flames",
    "What is the effect of the Freezing Spell?": "Immobilizes target",
    "What is the effect of the Full Body-Bind Curse?": "Paralyzes completely",
    "What is the effect of the Growth Charm?": "Enlarges objects",
    "What is the effect of the Hair-Curling Charm?": "Curls hair",
    "What is the effect of the Hot-Air Charm?": "Produces warm air",
    "What is the effect of the Ice Jinx?": "Creates ice patches",
    "What is the effect of the Invisibility Spell?": "Renders objects invisible",
    "What is the effect of the Jelly-Legs Jinx?": "Causes wobbly legs",
    "What is the effect of the Locking Spell?": "Seals doors",
    "What is the effect of the Locomotion Charm?": "Moves objects",
    "What is the effect of the Mooncalf Summoning Spell?": "Calls Mooncalves",
    "What is the effect of the Morsmordre?": "Conjures Dark Mark",
    "What is the effect of the Nox Spell?": "Extinguishes wand light",
    "What is the effect of the Oppugno Jinx?": "Directs objects to attack",
    "What is the effect of the Pepper Breath Hex?": "Induces fiery breath",
    "What is the effect of the Pimple Jinx?": "Causes acne",
    "What is the effect of the Poultry Jinx?": "Turns objects into chickens",
    "What is the effect of the Revulsion Jinx?": "Repels target",
    "What is the effect of the Rocket Charm?": "Propels objects upward",
    "What is the effect of the Scorching Spell?": "Burns objects",
    "What is the effect of the Slippery Jinx?": "Makes surfaces slick",
    "What is the effect of the Snack-Summoning Charm?": "Conjures food",
    "What is the effect of the Sonorous Charm?": "Amplifies voice",
    "What is the effect of the Spider-Conjuring Spell?": "Summons spiders",
    "What is the effect of the Stretching Jinx?": "Elongates objects",
    "What is the effect of the Swelling Solution?": "Causes body parts to swell",
    "What is the effect of the Tail-Growing Spell?": "Grows a tail",
    "What is the effect of the Tarantallegra Spell?": "Forces dancing",
    "What is the effect of the Teleportation Spell?": "Instantly transports",
    "What is the effect of the Tergeo Charm?": "Cleans spills",
    "What is the effect of the Tracking Spell?": "Locates targets",
    "What is the effect of the Twitchy-Ears Hex?": "Causes ear spasms",
    "What is the effect of the Ventus Spell?": "Conjures wind",
    "What is the effect of the Vermillious Spell?": "Shoots red sparks",
    "What is the effect of the Waddiwasi Spell?": "Shoots small objects",
    "What is the effect of the Weight-Lifting Charm?": "Reduces object weight",
    "What is the effect of the Windy Spell?": "Creates gusts",
    "What is the effect of the Withering Spell?": "Causes decay",
    "What is the effect of the Woodening Charm?": "Hardens objects"
  }